balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256DA106.PIC
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG3" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG3" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write Protection Flash Page Segment Boundary" edc:mask="0xff" edc:name="WPFP" edc:nzwidth="8">
              <edc:DCRFieldSemantic edc:cname="WPFP0" edc:desc="Page 0 (0x00)" edc:when="(field &amp; 0xff) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP1" edc:desc="Page 1 (0x400)" edc:when="(field &amp; 0xff) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP2" edc:desc="Page 2 (0x800)" edc:when="(field &amp; 0xff) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP3" edc:desc="Page 3 (0xC00)" edc:when="(field &amp; 0xff) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP4" edc:desc="Page 4 (0x1000)" edc:when="(field &amp; 0xff) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP5" edc:desc="Page 5 (0x1400)" edc:when="(field &amp; 0xff) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP6" edc:desc="Page 6 (0x1800)" edc:when="(field &amp; 0xff) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP7" edc:desc="Page 7 (0x1C00)" edc:when="(field &amp; 0xff) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP8" edc:desc="Page 8 (0x2000)" edc:when="(field &amp; 0xff) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP9" edc:desc="Page 9 (0x2400)" edc:when="(field &amp; 0xff) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP10" edc:desc="Page 10 (0x2800)" edc:when="(field &amp; 0xff) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="WPFP11" edc:desc="Page 11 (0x2C00)" edc:when="(field &amp; 0xff) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="WPFP12" edc:desc="Page 12 (0x3000)" edc:when="(field &amp; 0xff) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="WPFP13" edc:desc="Page 13 (0x3400)" edc:when="(field &amp; 0xff) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="WPFP14" edc:desc="Page 14 (0x3800)" edc:when="(field &amp; 0xff) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="WPFP15" edc:desc="Page 15 (0x3C00)" edc:when="(field &amp; 0xff) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="WPFP16" edc:desc="Page 16 (0x4000)" edc:when="(field &amp; 0xff) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WPFP17" edc:desc="Page 17 (0x4400)" edc:when="(field &amp; 0xff) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WPFP18" edc:desc="Page 18 (0x4800)" edc:when="(field &amp; 0xff) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WPFP19" edc:desc="Page 19 (0x4C00)" edc:when="(field &amp; 0xff) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WPFP20" edc:desc="Page 20 (0x5000)" edc:when="(field &amp; 0xff) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WPFP21" edc:desc="Page 21 (0x5400)" edc:when="(field &amp; 0xff) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WPFP22" edc:desc="Page 22 (0x5800)" edc:when="(field &amp; 0xff) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WPFP23" edc:desc="Page 23 (0x5C00)" edc:when="(field &amp; 0xff) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WPFP24" edc:desc="Page 24 (0x6000)" edc:when="(field &amp; 0xff) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WPFP25" edc:desc="Page 25 (0x6400)" edc:when="(field &amp; 0xff) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WPFP26" edc:desc="Page 26 (0x6800)" edc:when="(field &amp; 0xff) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP27" edc:desc="Page 27 (0x6C00)" edc:when="(field &amp; 0xff) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP28" edc:desc="Page 28 (0x7000)" edc:when="(field &amp; 0xff) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP29" edc:desc="Page 29 (0x7400)" edc:when="(field &amp; 0xff) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP30" edc:desc="Page 30 (0x7800)" edc:when="(field &amp; 0xff) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP31" edc:desc="Page 31 (0x7C00)" edc:when="(field &amp; 0xff) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP32" edc:desc="Page 32 (0x8000)" edc:when="(field &amp; 0xff) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="WPFP33" edc:desc="Page 33 (0x8400)" edc:when="(field &amp; 0xff) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="WPFP34" edc:desc="Page 34 (0x8800)" edc:when="(field &amp; 0xff) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="WPFP35" edc:desc="Page 35 (0x8C00)" edc:when="(field &amp; 0xff) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="WPFP36" edc:desc="Page 36 (0x9000)" edc:when="(field &amp; 0xff) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="WPFP37" edc:desc="Page 37 (0x9400)" edc:when="(field &amp; 0xff) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="WPFP38" edc:desc="Page 38 (0x9800)" edc:when="(field &amp; 0xff) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="WPFP39" edc:desc="Page 39 (0x9C00)" edc:when="(field &amp; 0xff) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="WPFP40" edc:desc="Page 40 (0xA000)" edc:when="(field &amp; 0xff) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="WPFP41" edc:desc="Page 41 (0xA400)" edc:when="(field &amp; 0xff) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="WPFP42" edc:desc="Page 42 (0xA800)" edc:when="(field &amp; 0xff) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP43" edc:desc="Page 43 (0xAC00)" edc:when="(field &amp; 0xff) == 0x2B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP44" edc:desc="Page 44 (0xB000)" edc:when="(field &amp; 0xff) == 0x2C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP45" edc:desc="Page 45 (0xB400)" edc:when="(field &amp; 0xff) == 0x2D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP46" edc:desc="Page 46 (0xB800)" edc:when="(field &amp; 0xff) == 0x2E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP47" edc:desc="Page 47 (0xBC00)" edc:when="(field &amp; 0xff) == 0x2F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP48" edc:desc="Page 48 (0xC000)" edc:when="(field &amp; 0xff) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="WPFP49" edc:desc="Page 49 (0xC400)" edc:when="(field &amp; 0xff) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="WPFP50" edc:desc="Page 50 (0xC800)" edc:when="(field &amp; 0xff) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="WPFP51" edc:desc="Page 51 (0xCC00)" edc:when="(field &amp; 0xff) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="WPFP52" edc:desc="Page 52 (0xD000)" edc:when="(field &amp; 0xff) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="WPFP53" edc:desc="Page 53 (0xD400)" edc:when="(field &amp; 0xff) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="WPFP54" edc:desc="Page 54 (0xD800)" edc:when="(field &amp; 0xff) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="WPFP55" edc:desc="Page 55 (0xDC00)" edc:when="(field &amp; 0xff) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="WPFP56" edc:desc="Page 56 (0xE000)" edc:when="(field &amp; 0xff) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="WPFP57" edc:desc="Page 57 (0xE400)" edc:when="(field &amp; 0xff) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="WPFP58" edc:desc="Page 58 (0xE800)" edc:when="(field &amp; 0xff) == 0x3A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP59" edc:desc="Page 59 (0xEC00)" edc:when="(field &amp; 0xff) == 0x3B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP60" edc:desc="Page 60 (0xF000)" edc:when="(field &amp; 0xff) == 0x3C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP61" edc:desc="Page 61 (0xF400)" edc:when="(field &amp; 0xff) == 0x3D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP62" edc:desc="Page 62 (0xF800)" edc:when="(field &amp; 0xff) == 0x3E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP63" edc:desc="Page 63 (0xFC00)" edc:when="(field &amp; 0xff) == 0x3F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP64" edc:desc="Page 64 (0x10000)" edc:when="(field &amp; 0xff) == 0x40"/>
              <edc:DCRFieldSemantic edc:cname="WPFP65" edc:desc="Page 65 (0x10400)" edc:when="(field &amp; 0xff) == 0x41"/>
              <edc:DCRFieldSemantic edc:cname="WPFP66" edc:desc="Page 66 (0x10800)" edc:when="(field &amp; 0xff) == 0x42"/>
              <edc:DCRFieldSemantic edc:cname="WPFP67" edc:desc="Page 67 (0x10C00)" edc:when="(field &amp; 0xff) == 0x43"/>
              <edc:DCRFieldSemantic edc:cname="WPFP68" edc:desc="Page 68 (0x11000)" edc:when="(field &amp; 0xff) == 0x44"/>
              <edc:DCRFieldSemantic edc:cname="WPFP69" edc:desc="Page 69 (0x11400)" edc:when="(field &amp; 0xff) == 0x45"/>
              <edc:DCRFieldSemantic edc:cname="WPFP70" edc:desc="Page 70 (0x11800)" edc:when="(field &amp; 0xff) == 0x46"/>
              <edc:DCRFieldSemantic edc:cname="WPFP71" edc:desc="Page 71 (0x11C00)" edc:when="(field &amp; 0xff) == 0x47"/>
              <edc:DCRFieldSemantic edc:cname="WPFP72" edc:desc="Page 72 (0x12000)" edc:when="(field &amp; 0xff) == 0x48"/>
              <edc:DCRFieldSemantic edc:cname="WPFP73" edc:desc="Page 73 (0x12400)" edc:when="(field &amp; 0xff) == 0x49"/>
              <edc:DCRFieldSemantic edc:cname="WPFP74" edc:desc="Page 74 (0x12800)" edc:when="(field &amp; 0xff) == 0x4A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP75" edc:desc="Page 75 (0x12C00)" edc:when="(field &amp; 0xff) == 0x4B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP76" edc:desc="Page 76 (0x13000)" edc:when="(field &amp; 0xff) == 0x4C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP77" edc:desc="Page 77 (0x13400)" edc:when="(field &amp; 0xff) == 0x4D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP78" edc:desc="Page 78 (0x13800)" edc:when="(field &amp; 0xff) == 0x4E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP79" edc:desc="Page 79 (0x13C00)" edc:when="(field &amp; 0xff) == 0x4F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP80" edc:desc="Page 80 (0x14000)" edc:when="(field &amp; 0xff) == 0x50"/>
              <edc:DCRFieldSemantic edc:cname="WPFP81" edc:desc="Page 81 (0x14400)" edc:when="(field &amp; 0xff) == 0x51"/>
              <edc:DCRFieldSemantic edc:cname="WPFP82" edc:desc="Page 82 (0x14800)" edc:when="(field &amp; 0xff) == 0x52"/>
              <edc:DCRFieldSemantic edc:cname="WPFP83" edc:desc="Page 83 (0x14C00)" edc:when="(field &amp; 0xff) == 0x53"/>
              <edc:DCRFieldSemantic edc:cname="WPFP84" edc:desc="Page 84 (0x15000)" edc:when="(field &amp; 0xff) == 0x54"/>
              <edc:DCRFieldSemantic edc:cname="WPFP85" edc:desc="Page 85 (0x15400)" edc:when="(field &amp; 0xff) == 0x55"/>
              <edc:DCRFieldSemantic edc:cname="WPFP86" edc:desc="Page 86 (0x15800)" edc:when="(field &amp; 0xff) == 0x56"/>
              <edc:DCRFieldSemantic edc:cname="WPFP87" edc:desc="Page 87 (0x15C00)" edc:when="(field &amp; 0xff) == 0x57"/>
              <edc:DCRFieldSemantic edc:cname="WPFP88" edc:desc="Page 88 (0x16000)" edc:when="(field &amp; 0xff) == 0x58"/>
              <edc:DCRFieldSemantic edc:cname="WPFP89" edc:desc="Page 89 (0x16400)" edc:when="(field &amp; 0xff) == 0x59"/>
              <edc:DCRFieldSemantic edc:cname="WPFP90" edc:desc="Page 90 (0x16800)" edc:when="(field &amp; 0xff) == 0x5A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP91" edc:desc="Page 91 (0x16C00)" edc:when="(field &amp; 0xff) == 0x5B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP92" edc:desc="Page 92 (0x17000)" edc:when="(field &amp; 0xff) == 0x5C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP93" edc:desc="Page 93 (0x17400)" edc:when="(field &amp; 0xff) == 0x5D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP94" edc:desc="Page 94 (0x17800)" edc:when="(field &amp; 0xff) == 0x5E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP95" edc:desc="Page 95 (0x17C00)" edc:when="(field &amp; 0xff) == 0x5F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP96" edc:desc="Page 96 (0x18000)" edc:when="(field &amp; 0xff) == 0x60"/>
              <edc:DCRFieldSemantic edc:cname="WPFP97" edc:desc="Page 97 (0x18400)" edc:when="(field &amp; 0xff) == 0x61"/>
              <edc:DCRFieldSemantic edc:cname="WPFP98" edc:desc="Page 98 (0x18800)" edc:when="(field &amp; 0xff) == 0x62"/>
              <edc:DCRFieldSemantic edc:cname="WPFP99" edc:desc="Page 99 (0x18C00)" edc:when="(field &amp; 0xff) == 0x63"/>
              <edc:DCRFieldSemantic edc:cname="WPFP100" edc:desc="Page 100 (0x19000)" edc:when="(field &amp; 0xff) == 0x64"/>
              <edc:DCRFieldSemantic edc:cname="WPFP101" edc:desc="Page 101 (0x19400)" edc:when="(field &amp; 0xff) == 0x65"/>
              <edc:DCRFieldSemantic edc:cname="WPFP102" edc:desc="Page 102 (0x19800)" edc:when="(field &amp; 0xff) == 0x66"/>
              <edc:DCRFieldSemantic edc:cname="WPFP103" edc:desc="Page 103 (0x19C00)" edc:when="(field &amp; 0xff) == 0x67"/>
              <edc:DCRFieldSemantic edc:cname="WPFP104" edc:desc="Page 104 (0x1A000)" edc:when="(field &amp; 0xff) == 0x68"/>
              <edc:DCRFieldSemantic edc:cname="WPFP105" edc:desc="Page 105 (0x1A400)" edc:when="(field &amp; 0xff) == 0x69"/>
              <edc:DCRFieldSemantic edc:cname="WPFP106" edc:desc="Page 106 (0x1A800)" edc:when="(field &amp; 0xff) == 0x6A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP107" edc:desc="Page 107 (0x1AC00)" edc:when="(field &amp; 0xff) == 0x6B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP108" edc:desc="Page 108 (0x1B000)" edc:when="(field &amp; 0xff) == 0x6C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP109" edc:desc="Page 109 (0x1B400)" edc:when="(field &amp; 0xff) == 0x6D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP110" edc:desc="Page 110 (0x1B800)" edc:when="(field &amp; 0xff) == 0x6E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP111" edc:desc="Page 111 (0x1BC00)" edc:when="(field &amp; 0xff) == 0x6F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP112" edc:desc="Page 112 (0x1C000)" edc:when="(field &amp; 0xff) == 0x70"/>
              <edc:DCRFieldSemantic edc:cname="WPFP113" edc:desc="Page 113 (0x1C400)" edc:when="(field &amp; 0xff) == 0x71"/>
              <edc:DCRFieldSemantic edc:cname="WPFP114" edc:desc="Page 114 (0x1C800)" edc:when="(field &amp; 0xff) == 0x72"/>
              <edc:DCRFieldSemantic edc:cname="WPFP115" edc:desc="Page 115 (0x1CC00)" edc:when="(field &amp; 0xff) == 0x73"/>
              <edc:DCRFieldSemantic edc:cname="WPFP116" edc:desc="Page 116 (0x1D000)" edc:when="(field &amp; 0xff) == 0x74"/>
              <edc:DCRFieldSemantic edc:cname="WPFP117" edc:desc="Page 117 (0x1D400)" edc:when="(field &amp; 0xff) == 0x75"/>
              <edc:DCRFieldSemantic edc:cname="WPFP118" edc:desc="Page 118 (0x1D800)" edc:when="(field &amp; 0xff) == 0x76"/>
              <edc:DCRFieldSemantic edc:cname="WPFP119" edc:desc="Page 119 (0x1DC00)" edc:when="(field &amp; 0xff) == 0x77"/>
              <edc:DCRFieldSemantic edc:cname="WPFP120" edc:desc="Page 120 (0x1E000)" edc:when="(field &amp; 0xff) == 0x78"/>
              <edc:DCRFieldSemantic edc:cname="WPFP121" edc:desc="Page 121 (0x1E400)" edc:when="(field &amp; 0xff) == 0x79"/>
              <edc:DCRFieldSemantic edc:cname="WPFP122" edc:desc="Page 122 (0x1E800)" edc:when="(field &amp; 0xff) == 0x7A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP123" edc:desc="Page 123 (0x1EC00)" edc:when="(field &amp; 0xff) == 0x7B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP124" edc:desc="Page 124 (0x1F000)" edc:when="(field &amp; 0xff) == 0x7C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP125" edc:desc="Page 125 (0x1F400)" edc:when="(field &amp; 0xff) == 0x7D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP126" edc:desc="Page 126 (0x1F800)" edc:when="(field &amp; 0xff) == 0x7E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP127" edc:desc="Page 127 (0x1FC00)" edc:when="(field &amp; 0xff) == 0x7F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP128" edc:desc="Page 128 (0x20000)" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="WPFP129" edc:desc="Page 129 (0x20400)" edc:when="(field &amp; 0xff) == 0x81"/>
              <edc:DCRFieldSemantic edc:cname="WPFP130" edc:desc="Page 130 (0x20800)" edc:when="(field &amp; 0xff) == 0x82"/>
              <edc:DCRFieldSemantic edc:cname="WPFP131" edc:desc="Page 131 (0x20C00)" edc:when="(field &amp; 0xff) == 0x83"/>
              <edc:DCRFieldSemantic edc:cname="WPFP132" edc:desc="Page 132 (0x21000)" edc:when="(field &amp; 0xff) == 0x84"/>
              <edc:DCRFieldSemantic edc:cname="WPFP133" edc:desc="Page 133 (0x21400)" edc:when="(field &amp; 0xff) == 0x85"/>
              <edc:DCRFieldSemantic edc:cname="WPFP134" edc:desc="Page 134 (0x21800)" edc:when="(field &amp; 0xff) == 0x86"/>
              <edc:DCRFieldSemantic edc:cname="WPFP135" edc:desc="Page 135 (0x21C00)" edc:when="(field &amp; 0xff) == 0x87"/>
              <edc:DCRFieldSemantic edc:cname="WPFP136" edc:desc="Page 136 (0x22000)" edc:when="(field &amp; 0xff) == 0x88"/>
              <edc:DCRFieldSemantic edc:cname="WPFP137" edc:desc="Page 137 (0x22400)" edc:when="(field &amp; 0xff) == 0x89"/>
              <edc:DCRFieldSemantic edc:cname="WPFP138" edc:desc="Page 138 (0x22800)" edc:when="(field &amp; 0xff) == 0x8A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP139" edc:desc="Page 139 (0x22C00)" edc:when="(field &amp; 0xff) == 0x8B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP140" edc:desc="Page 140 (0x23000)" edc:when="(field &amp; 0xff) == 0x8C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP141" edc:desc="Page 141 (0x23400)" edc:when="(field &amp; 0xff) == 0x8D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP142" edc:desc="Page 142 (0x23800)" edc:when="(field &amp; 0xff) == 0x8E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP143" edc:desc="Page 143 (0x23C00)" edc:when="(field &amp; 0xff) == 0x8F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP144" edc:desc="Page 144 (0x24000)" edc:when="(field &amp; 0xff) == 0x90"/>
              <edc:DCRFieldSemantic edc:cname="WPFP145" edc:desc="Page 145 (0x24400)" edc:when="(field &amp; 0xff) == 0x91"/>
              <edc:DCRFieldSemantic edc:cname="WPFP146" edc:desc="Page 146 (0x24800)" edc:when="(field &amp; 0xff) == 0x92"/>
              <edc:DCRFieldSemantic edc:cname="WPFP147" edc:desc="Page 147 (0x24C00)" edc:when="(field &amp; 0xff) == 0x93"/>
              <edc:DCRFieldSemantic edc:cname="WPFP148" edc:desc="Page 148 (0x25000)" edc:when="(field &amp; 0xff) == 0x94"/>
              <edc:DCRFieldSemantic edc:cname="WPFP149" edc:desc="Page 149 (0x25400)" edc:when="(field &amp; 0xff) == 0x95"/>
              <edc:DCRFieldSemantic edc:cname="WPFP150" edc:desc="Page 150 (0x25800)" edc:when="(field &amp; 0xff) == 0x96"/>
              <edc:DCRFieldSemantic edc:cname="WPFP151" edc:desc="Page 151 (0x25C00)" edc:when="(field &amp; 0xff) == 0x97"/>
              <edc:DCRFieldSemantic edc:cname="WPFP152" edc:desc="Page 152 (0x26000)" edc:when="(field &amp; 0xff) == 0x98"/>
              <edc:DCRFieldSemantic edc:cname="WPFP153" edc:desc="Page 153 (0x26400)" edc:when="(field &amp; 0xff) == 0x99"/>
              <edc:DCRFieldSemantic edc:cname="WPFP154" edc:desc="Page 154 (0x26800)" edc:when="(field &amp; 0xff) == 0x9A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP155" edc:desc="Page 155 (0x26C00)" edc:when="(field &amp; 0xff) == 0x9B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP156" edc:desc="Page 156 (0x27000)" edc:when="(field &amp; 0xff) == 0x9C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP157" edc:desc="Page 157 (0x27400)" edc:when="(field &amp; 0xff) == 0x9D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP158" edc:desc="Page 158 (0x27800)" edc:when="(field &amp; 0xff) == 0x9E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP159" edc:desc="Page 159 (0x27C00)" edc:when="(field &amp; 0xff) == 0x9F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP160" edc:desc="Page 160 (0x28000)" edc:when="(field &amp; 0xff) == 0xA0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP161" edc:desc="Page 161 (0x28400)" edc:when="(field &amp; 0xff) == 0xA1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP162" edc:desc="Page 162 (0x28800)" edc:when="(field &amp; 0xff) == 0xA2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP163" edc:desc="Page 163 (0x28C00)" edc:when="(field &amp; 0xff) == 0xA3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP164" edc:desc="Page 164 (0x29000)" edc:when="(field &amp; 0xff) == 0xA4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP165" edc:desc="Page 165 (0x29400)" edc:when="(field &amp; 0xff) == 0xA5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP166" edc:desc="Page 166 (0x29800)" edc:when="(field &amp; 0xff) == 0xA6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP167" edc:desc="Page 167 (0x29C00)" edc:when="(field &amp; 0xff) == 0xA7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP168" edc:desc="Page 168 (0x2A000)" edc:when="(field &amp; 0xff) == 0xA8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP169" edc:desc="Page 169 (0x2A400)" edc:when="(field &amp; 0xff) == 0xA9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP170" edc:desc="Page 170 (0x2A800)" edc:when="(field &amp; 0xff) == 0xAA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP255" edc:desc="Highest Page (same as page 170)" edc:when="(field &amp; 0xff) == 0xff"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="Secondary Oscillator Power Mode Select" edc:mask="0x3" edc:name="SOSCSEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary oscillator is in Default (high drive strength) Oscillator mode" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="LPSOSC" edc:desc="Secondary oscillator is in Low-Power (low drive strength) Oscillator mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External clock (SCLKI) or Digital I/O mode(" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WUTSEL" edc:desc="Voltage Regulator Wake-up Time Select" edc:mask="0x3" edc:name="WUTSEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="FST" edc:desc="Fast regulator start-up time is used" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LEG" edc:desc="Default regulator start-up time is used" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTPMP" edc:desc="Alternate PMP Pin Mapping" edc:mask="0x1" edc:name="ALTPMP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ALPMPDIS" edc:desc="EPMP pins are in default location mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ALTPMPEN" edc:desc="EPMP pins are in alternate location mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Segmented code protection is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
