balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256DA106.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1CLUTRD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1CLUTRD" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLUTRD" edc:desc="" edc:mask="0xffff" edc:name="CLUTRD" edc:nzwidth="16"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLUTRD0" edc:desc="" edc:mask="0x1" edc:name="CLUTRD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD1" edc:desc="" edc:mask="0x1" edc:name="CLUTRD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD2" edc:desc="" edc:mask="0x1" edc:name="CLUTRD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD3" edc:desc="" edc:mask="0x1" edc:name="CLUTRD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD4" edc:desc="" edc:mask="0x1" edc:name="CLUTRD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD5" edc:desc="" edc:mask="0x1" edc:name="CLUTRD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD6" edc:desc="" edc:mask="0x1" edc:name="CLUTRD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD7" edc:desc="" edc:mask="0x1" edc:name="CLUTRD7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD8" edc:desc="" edc:mask="0x1" edc:name="CLUTRD8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD9" edc:desc="" edc:mask="0x1" edc:name="CLUTRD9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD10" edc:desc="" edc:mask="0x1" edc:name="CLUTRD10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD11" edc:desc="" edc:mask="0x1" edc:name="CLUTRD11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD12" edc:desc="" edc:mask="0x1" edc:name="CLUTRD12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD13" edc:desc="" edc:mask="0x1" edc:name="CLUTRD13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD14" edc:desc="" edc:mask="0x1" edc:name="CLUTRD14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTRD15" edc:desc="" edc:mask="0x1" edc:name="CLUTRD15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1MRGN" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1MRGN" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HBAMGN" edc:desc="" edc:mask="0xff" edc:name="HBAMGN" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="VBAMGN" edc:desc="" edc:mask="0xff" edc:name="VBAMGN" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HBAMGN0" edc:desc="" edc:mask="0x1" edc:name="HBAMGN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN1" edc:desc="" edc:mask="0x1" edc:name="HBAMGN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN2" edc:desc="" edc:mask="0x1" edc:name="HBAMGN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN3" edc:desc="" edc:mask="0x1" edc:name="HBAMGN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN4" edc:desc="" edc:mask="0x1" edc:name="HBAMGN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN5" edc:desc="" edc:mask="0x1" edc:name="HBAMGN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN6" edc:desc="" edc:mask="0x1" edc:name="HBAMGN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HBAMGN7" edc:desc="" edc:mask="0x1" edc:name="HBAMGN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN0" edc:desc="" edc:mask="0x1" edc:name="VBAMGN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN1" edc:desc="" edc:mask="0x1" edc:name="VBAMGN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN2" edc:desc="" edc:mask="0x1" edc:name="VBAMGN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN3" edc:desc="" edc:mask="0x1" edc:name="VBAMGN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN4" edc:desc="" edc:mask="0x1" edc:name="VBAMGN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN5" edc:desc="" edc:mask="0x1" edc:name="VBAMGN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN6" edc:desc="" edc:mask="0x1" edc:name="VBAMGN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBAMGN7" edc:desc="" edc:mask="0x1" edc:name="VBAMGN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1CHRX" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1CHRX" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CURPOSX" edc:desc="" edc:mask="0x7ff" edc:name="CURPOSX" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CURPOSX0" edc:desc="" edc:mask="0x1" edc:name="CURPOSX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX1" edc:desc="" edc:mask="0x1" edc:name="CURPOSX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX2" edc:desc="" edc:mask="0x1" edc:name="CURPOSX2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX3" edc:desc="" edc:mask="0x1" edc:name="CURPOSX3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX4" edc:desc="" edc:mask="0x1" edc:name="CURPOSX4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX5" edc:desc="" edc:mask="0x1" edc:name="CURPOSX5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX6" edc:desc="" edc:mask="0x1" edc:name="CURPOSX6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX7" edc:desc="" edc:mask="0x1" edc:name="CURPOSX7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX8" edc:desc="" edc:mask="0x1" edc:name="CURPOSX8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX9" edc:desc="" edc:mask="0x1" edc:name="CURPOSX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSX10" edc:desc="" edc:mask="0x1" edc:name="CURPOSX10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1CHRY" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1CHRY" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CURPOSY" edc:desc="" edc:mask="0x7ff" edc:name="CURPOSY" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CURPOSY0" edc:desc="" edc:mask="0x1" edc:name="CURPOSY0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY1" edc:desc="" edc:mask="0x1" edc:name="CURPOSY1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY2" edc:desc="" edc:mask="0x1" edc:name="CURPOSY2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY3" edc:desc="" edc:mask="0x1" edc:name="CURPOSY3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY4" edc:desc="" edc:mask="0x1" edc:name="CURPOSY4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY5" edc:desc="" edc:mask="0x1" edc:name="CURPOSY5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY6" edc:desc="" edc:mask="0x1" edc:name="CURPOSY6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY7" edc:desc="" edc:mask="0x1" edc:name="CURPOSY7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY8" edc:desc="" edc:mask="0x1" edc:name="CURPOSY8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY9" edc:desc="" edc:mask="0x1" edc:name="CURPOSY9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CURPOSY10" edc:desc="" edc:mask="0x1" edc:name="CURPOSY10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="G1IPU" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="G1IPU" edc:nzwidth="16" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BFINAL" edc:desc="" edc:mask="0x1" edc:name="BFINAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPUDONE" edc:desc="" edc:mask="0x1" edc:name="IPUDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRAPERR" edc:desc="" edc:mask="0x1" edc:name="WRAPERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LENERR" edc:desc="" edc:mask="0x1" edc:name="LENERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLCKERR" edc:desc="" edc:mask="0x1" edc:name="BLCKERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HUFFERR" edc:desc="" edc:mask="0x1" edc:name="HUFFERR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1DBEN" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1DBEN" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GDBEN" edc:desc="" edc:mask="0xffff" edc:name="GDBEN" edc:nzwidth="16"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GDBEN0" edc:desc="" edc:mask="0x1" edc:name="GDBEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN1" edc:desc="" edc:mask="0x1" edc:name="GDBEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN2" edc:desc="" edc:mask="0x1" edc:name="GDBEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN3" edc:desc="" edc:mask="0x1" edc:name="GDBEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN4" edc:desc="" edc:mask="0x1" edc:name="GDBEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN5" edc:desc="" edc:mask="0x1" edc:name="GDBEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN6" edc:desc="" edc:mask="0x1" edc:name="GDBEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN7" edc:desc="" edc:mask="0x1" edc:name="GDBEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN8" edc:desc="" edc:mask="0x1" edc:name="GDBEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN9" edc:desc="" edc:mask="0x1" edc:name="GDBEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN10" edc:desc="" edc:mask="0x1" edc:name="GDBEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN11" edc:desc="" edc:mask="0x1" edc:name="GDBEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN12" edc:desc="" edc:mask="0x1" edc:name="GDBEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN13" edc:desc="" edc:mask="0x1" edc:name="GDBEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN14" edc:desc="" edc:mask="0x1" edc:name="GDBEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GDBEN15" edc:desc="" edc:mask="0x1" edc:name="GDBEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000011" edc:name="RCON" edc:nzwidth="0x10" edc:por="00----0000000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x1" edc:name="CM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMSLP" edc:desc="" edc:mask="0x1" edc:name="PMSLP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-nnnsnr-cnnn" edc:cname="OSCCON" edc:desc="" edc:impl="0x77ab" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-yyy00000000" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="-000-yyy00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSCEN" edc:desc="" edc:mask="0x1" edc:name="POSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="" edc:mask="0x1" edc:name="LPOSCEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:desc="" edc:mask="0x1" edc:name="NOSC2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:desc="" edc:mask="0x1" edc:name="COSC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnn----" edc:cname="CLKDIV" edc:desc="" edc:impl="0xffc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000010000----" edc:name="CLKDIV" edc:nzwidth="0x10" edc:por="000000010000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="G1CLKSEL" edc:desc="" edc:mask="0x1" edc:name="G1CLKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLEN" edc:desc="" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPDIV" edc:desc="" edc:mask="0x3" edc:name="CPDIV" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RCDIV" edc:desc="" edc:mask="0x7" edc:name="RCDIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DOZEN" edc:desc="" edc:mask="0x1" edc:name="DOZEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE" edc:desc="" edc:mask="0x7" edc:name="DOZE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ROI" edc:desc="" edc:mask="0x1" edc:name="ROI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="CPDIV0" edc:desc="" edc:mask="0x1" edc:name="CPDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPDIV1" edc:desc="" edc:mask="0x1" edc:name="CPDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCDIV0" edc:desc="" edc:mask="0x1" edc:name="RCDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCDIV1" edc:desc="" edc:mask="0x1" edc:name="RCDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCDIV2" edc:desc="" edc:mask="0x1" edc:name="RCDIV2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DOZE0" edc:desc="" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE1" edc:desc="" edc:mask="0x1" edc:name="DOZE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE2" edc:desc="" edc:mask="0x1" edc:name="DOZE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn---------" edc:cname="CLKDIV2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000---------" edc:name="CLKDIV2" edc:nzwidth="16" edc:por="0000000---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV" edc:desc="" edc:mask="0x7f" edc:name="GCLKDIV" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV0" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV1" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV2" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV3" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV4" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV5" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCLKDIV6" edc:desc="" edc:mask="0x1" edc:name="GCLKDIV6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
